;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 15 March 2025
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: https://rizonesoft.com
;~ =============================================================================

[Main]
Product = Firemin
Version = 12

[Language]
;~ Please ad the translated language name next to the English name. For example; Ελληνικά - Greek
Name = Русский - Russian
Code = ru
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = О программе %{Program.Name}
Label_Version = Версия
Label_AutoIt = Создано с использованием AutoIt версии
Label_Copyright = Авторские права
Tip_Title_Donate = Поддержите нашу работу
Tip_Message_Donate = Ваше пожертвование поможет нам сохранить наше программное обеспечение бесплатным\r\nи позволит нам приобретать инструменты и услуги,\r\nкоторые мы используем для вашего обслуживания.
Label_Home = Домашняя страница
Label_License = Лицензия
Label_Support = Получить поддержку
Tip_Title_Country = Сделано в ЮАР
Tip_Message_Country = %{Program.Name} был создан в Южно-Африканской Республике.
Label_Contributors = Участники
Button_Ok = OK
Label_RAM = (RAM) %d МБ свободно из %d МБ (%d%%)
Label_HDD = (%s) %.2f ГБ свободно из %.2f ГБ (%d%%)
Tip_Facebook = Подписывайтесь на нас в Facebook.
Tip_GitHub = %{Program.Name} на GitHub.

[Custom]
Label_Status_Welcome = Начните с загрузки браузера (выберите файл).\r\n%{Program.Name} автоматически обнаружит процесс из выбранного исполняемого файла.
Label_Status_Updates = Проверка обновлений
Group_Load_Browser = Загрузить браузер
Label_Executable = Путь к исполняемому файлу (%s):
Label_Process_Usage = Использование | Пик:
Label_Process_Count = Количество процессов:
Button_Browse = &Обзор
Group_Options = Параметры
Checkbox_Reduce_Mem = Уменьшать память каждые:
Label_Milliseconds = миллисекунд
Checkbox_Reduce_Limit = Уменьшать память, когда использование превышает:
Checkbox_Start_With = Запускать %s при старте %{Program.Name}
Checkbox_Enable_Extended_Processes = Включить расширенные процессы
Button_Extended_Processes = &Расширенные процессы
Checkbox_Start_Windows = Запускать %{Program.Name} при старте Windows
Label_Settings_Updated = Настройки успешно обновлены.
Button_Cancel = Отмена
Button_Save = Сохранить
Time_Unit_01 = миллисекунд
Time_Unit_02 = секунд
Time_Unit_03 = минут
Time_Unit_04 = часов
Label_Boost_Description = Уменьшать каждые %s %s, когда использование превышает %s МБ.
Title_Select_Browser = Выбрать браузер
Tip_Minimized_Title = %{Program.Name} все еще работает!
Tip_Minimized_Message = %{Program.Name} продолжит оптимизировать использование памяти %s.\r\nНажмите на значок в системном трее для изменения различных параметров оптимизации.
Label_Notice = %{Program.Name} предназначен для использования на настольных компьютерах и ноутбуках.\r\nДля серверных сред мы создали Firemin Server. Узнать больше...

[Donate]
Label_Heading = Как насчет небольшого пожертвования, чтобы наше программное обеспечение оставалось бесплатным навсегда?
Label_Message = Нажмите на кнопку PayPal ниже, выберите сумму и отправьте пожертвование.\r\nВаше пожертвование поможет улучшить наше программное обеспечение и сохранить все бесплатным на Rizonesoft.\r\nПожертвование в размере $20 поможет нам работать как минимум месяц.
Label_Donate = Не хотите ли сделать пожертвование в размере $10, чтобы помочь нам улучшить %{Program.Name} и продолжить нашу миссию?

[Menus]
File = &Файл
File_Preferences = &Настройки
File_Close = &Выход\tShift+Alt+F4
Help = &Справка
Help_Update = &Проверить обновления
Help_Home = &Домашняя страница %{Company.Name}
Help_Downloads = &Другие загрузки
Help_Support = &Получить поддержку
Help_Issue = &Сообщить о проблеме
Help_Donate = &Поддержать нашу работу
Help_About = О программе %{Program.Name}
Tray_About = О программе %{Program.Name} %s
Tray_Open = Открыть %{Program.Name}
Tray_Extended_Processes = Расширенные процессы
Tray_Run = Запустить %s
Tray_Run_Safemode = Запустить %s в безопасном режиме

[Messages]
Info_Title = Обратите внимание
Warning_Title = Внимание!
Error_Title = Упс! Что-то пошло не так!
Error_Oops = Упс!
Singleton = Другой экземпляр %{Program.Name} уже запущен.\r\nПодсказка: Нажмите на значок %{Program.Name} в системном трее.
Compatible = %{Program.Name} не совместим с вашей версией Windows.\r\nЕсли вы считаете, что это ошибка, не стесняйтесь оставить сообщение на '%s' со всеми подробностями.
Compatible_Bit = К сожалению, 32-битная версия %{Program.Name} не совместима с вашей версией Windows.\r\nПожалуйста, загрузите 64-битную версию %{Program.Name} с '%s'.

[Preferences]
Window_Title = Настройки
Tab_General = Общие
Tab_Performance = Производительность
Tab_Language = Язык
Group_Notifications = Уведомления
Group_Extended_Processes = Расширенные процессы
Group_Priority = Приоритет
Group_Memory = Память
Group_Language = Язык
Checkbox_Notifications = Показывать уведомления в системном трее
Label_Extended_Processes = Введите здесь имена дополнительных процессов, которые вы хотите, чтобы %{Program.Name} оптимизировал.\r\nСписок должен быть разделен запятыми (Process01.exe, Process02.exe и т.д.)
Label_SetPriority = Установить приоритет процесса:
Checkbox_SaveRealtime = Сохранить приоритет выше высокого (не рекомендуется).
Checkbox_ReduceMemory = Уменьшать память на системах с малым объемом памяти.
Label_Language_Message = Выберите предпочитаемый язык и нажмите кнопку %s для продолжения. (Требуется перезапуск)
Button_Save = Сохранить
Button_Cancel = Отмена
Label_Updated = Настройки обновлены
MsgBox_Language_Title = Язык изменен
MsgBox_Language_Message = Выбранный язык был изменен.\r\n%{Program.Name} необходимо перезапустить для применения выбранного языка.
MsgBox_Closing_Title = Закрытие %{Program.Name}
MsgBox_Closing_Message = Хотите закрыть %{Program.Name} сейчас?
Button_Export = Экспорт
Dialog_Export_Title = Экспорт расширенных процессов
Dialog_Export_Error_Title = Ошибка экспорта
Dialog_Export_Error_Message = Не удалось создать файл экспорта.
Dialog_Export_Success_Title = Экспорт успешно выполнен
Dialog_Export_Success_Message = Список расширенных процессов экспортирован в:
Button_Import = Импорт
Dialog_Import_Title = Импорт расширенных процессов
Dialog_Import_Error_Title = Ошибка импорта
Dialog_Import_Error_Message = Не удалось прочитать файл импорта.
Dialog_Import_Success_Title = Импорт успешно выполнен
Dialog_Import_Success_Message = Список расширенных процессов успешно импортирован.
Dialog_Import_Empty_Title = Процессы не найдены
Dialog_Import_Empty_Message = В выбранном файле не найдено действительных процессов.

[Update]
Window_Title_Available = Доступно обновление
Window_Title_Congratulations = Поздравляем!
Window_Title_Error = Что-то пошло не так!
Label_Message_Update = Доступна новая версия '%{Program.Name}'.
Label_Message_Latest = Вы используете последнюю версию '%{Program.Name}'.
Label_Message_Error = Не удалось получить информацию о последней версии '%{Program.Name}'.
Label_Message_Internet = Проверьте подключение к интернету и попробуйте снова.
Label_Build_Current = Текущая версия:
Label_Build_Update = Версия обновления:
CheckBox_NoUpdate = Не проверять обновления при запуске.
Button_Update = Узнать больше
Button_Close = Закрыть

[Versioning]
Administrator = Администратор
Build = Сборка
AutoIt_Version = Использует AutoIt версии %{AutoIt.Version}
Bit = бит